Revit API Introduction Labs
LabUtils.GetTargetInstances Method
 Helper to get all instances for a given category, identified either by a built-in category or by a category name.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public static List<Element> GetTargetInstances(
	Document doc,
	Object targetCategory
)
Visual Basic (Declaration)
Public Shared Function GetTargetInstances ( _
	doc As Document, _
	targetCategory As Object _
) As List(Of Element)
Visual C++
public:
static List<Element^>^ GetTargetInstances(
	Document^ doc,
	Object^ targetCategory
)
Parameters
doc
Type: Document
targetCategory
Type: System.Object
See Also
LabUtils Class
Labs Namespace